[
    {
    "post_id": 1,
    "title": "Light/Dark Mode Switcher",
    "description": "The process of implementing a light/dark mode switch across all webpages",
    "content": "I created and added a button to the right corner of my header. Since this header is loaded in every page, so is the button. Using a W3Schools tutorial, I wrote a script that makes the button switch themes on click. The light mode is the default white & pink theme that I implemented two months ago. For the black & blue dark theme, I added new styles, with class .dark-mode, that change the colors of elements. So, for example, the style .dark-mode header applies to my header tags. The script works by toggling the dark-mode class. So when it is light (meaning the dark mode class is not present), clicking on the button will add the dark-mode class, and clicking on it again removes it, causing the document to use the light theme again.<br><br>Also, the user selected theme is remembered across webpages using a local storage to store the current theme and display the page accordingly."
    },
    {
    "post_id": 2,
    "title": "Blog Post Display",
    "description": "How I created a dynamic blog section",
    "content": "I started out by creating a JSON file that acts like a dictionary, containing an array of objects. In this case, the objects are blog posts. Each blog post has keys (id, title, description, and content) and values attached to them. A script in my script file fetches the blog posts from the JSON file and displays them in the blog page. In the blog page, there is a division with ID blog-list which indicates where the script function run. The script also contains a loop that creates a division for each post and displays its title, description, and content with proper styling. Since the loop runs for each post in the file, it was not necessary to rewrite the same code repeatedly. Simply by adding proper information (valid key-value pairs) to the JSON file will cause a new post to show up in the blog page.<br><br>In the future, I could try adding pictures to each blog post but for now I cannot think of any good images to add to my current posts."
    }
]